SECRET_KEY = "sk-iXC2N_CPmS97ROX9ZXLDTw"

KEYWORDS_SET = {
    # 1. Продукты и услуги (Карты, Кредиты, Вклады)
    "more",
    "форсаж",
    "комплимент",
    "signature",
    "infinite",
    "plat/on",
    "портмоне 2.0",
    "отличник",
    "черепаха",
    "кстати",
    "на всё про всё",
    "дальше - меньше",
    "легко платить",
    "всё только начинается",
    "старт",
    "проще в онлайн",
    "автокредит без залога",
    "экспресс-кредит",
    "на роднае",
    "мои условия",
    "мои условия онлайн",
    "великий путь",
    "суперсемь",
    "подушка безопасности",
    "usd",
    "eur",
    "rub",
    "cny",
    # 2. Ключевые термины и аббревиатуры
    "втб (беларусь)",
    "зао банк втб (беларусь)",
    "мси",
    "межбанковская система идентификации",
    "vtb mbank",
    "vtb online",
    "дбо",
    "пдн",
    "показатель долговой нагрузки",
    "ерип",
    "аис «расчет»",
    "паспорт",
    "справка о доходах",
    "ип",
    "индивидуальный предприниматель",
    "самозанятый",
    "кредитный лимит",
    "ussd",
    "mir pay",
    "nfc",
    "белкарт",
    "платежная система «мир»",
    "пс «мир»",
    "byn",
    # 3. Операционные ключевые слова (действия и статусы)
    "регистрация",
    "онбординг",
    "оформление",
    "заявка",
    "восстановление",
    "закрыть вклад",
    "досрочно",
    "погашение",
    "лимиты",
    "активировать",
    "блокировка",
    "пополнить",
    "онлайн",
    "виртуальная карточка",
    "мгновенного выпуска",
}


def transpose_aliases(aliases: dict[str, list[str]]) -> dict[str, str]:
    vals = {}

    for k, v in aliases.items():
        for v in v:
            vals[v.strip().lower()] = k

    return vals


ALIASES = transpose_aliases(
    {
        "more": ["море", "mor"],
        "форсаж": ["forsage", "forsag"],
        # 'республика беларусь': ['рб', 'республики беларусь', 'беларусь', 'белоруссия', 'белорусь', 'belarus', 'belorussia', 'belorussia'],
        "пароль": ["password", "pass", "креды"],
        "комплимент": ["compliment"],
        "signature": [
            "сигнатура",
            "signa",
        ],
        "infinite": ["инфинити", "infinity", "infin", "инфинит", "инфин"],
        "plat/on": ["платон", "platon", "плат/он"],
        "портмоне": [
            "portmone",
            "portmon",
            "портмоне",
            "портмоне 2.0",
            "партмане",
            "портмане",
            "партмоне",
            "portmon",
        ],
        "отличник": [
            "otlichnik",
            "отличника",
            "отличнику",
            "отличником",
            "отличником",
            "отличнике",
        ],
        "черепаха": [
            "cherepaha",
            "чирипаха",
            "черипаха",
            "чирепаха",
            "черепах",
            "черепахе",
            "черепахой",
            "черепаху",
            "черепахи",
        ],
        # 'на всё про всё': ['на все про все', 'на все провсе', 'на всё про все', 'на все про всё', 'навсепровсе'],
        # 'дальше - меньше': ['дальше меньше', 'дальше - меньше', 'дальше-меньше', 'дальшеменьше'],
        # 'легко платить': ['легкоплатить', 'легко-платить', 'легко - платить', 'платить легко', 'платить-легко', 'платить - легко'],/
        # 'все только начинается': ['все только начинается', 'всё только начинаеться', 'все только начинаеться', 'всё тока начинается', 'все тока начинается', 'все только начинаться', 'всё только началось', 'все только началось', 'все тольконачинается', 'все-только-начинается'],
        "старт": ["start", "стартт", "стар", "старта"],
        # 'проще в онлайн': ['prosche v onlain', 'проще онлайн', 'прощевонлайн', 'проще в онлайне', 'проще в online', 'проще онлайн!', 'проще в онлайне?', 'прощевонлайн', 'проще-в-онлайн'],
        # 'автокредит без залога': ['avtokredit bez zalogа', 'автокредит без залога', 'автокредит беззалога', 'авто кредит без залога', 'автокредит без залогов', 'car loan no collateral', 'автокредит без обеспечения', 'автокредит без залога!', 'автокредитбеззалога'],
        # 'На роднае': ['na rodnae', 'на родное', 'на роднай', 'на роднэ', 'на роднае!', 'народнае', 'на родное дело', 'народное'],
        # 'Мои условия': ['moi usloviya', 'мои условия', 'моиусловия', 'мои условие', 'мои условия!', 'my terms', 'мои условия кредита', 'условия мои'],
        # 'Мои условия онлайн': ['moi usloviya onlain', 'мои условия онлайн', 'моиусловияонлайн', 'мои условия online', 'мои условия в онлайне', 'my terms online', 'мои онлайн условия'],
        # 'Великий путь': ['velikiy put', 'великий путь', 'великий путь!', 'великий пудь', 'великий пут', 'great way', 'великий путь онлайн', 'великий путь вперед'],
        # 'СуперСемь': ['supersiem', 'супер семь', 'супер7', 'суперсемь!', 'super7', 'суперсем', 'суперсемь7', 'супер7'],
        # 'Подушка безопасности': ['podushka bezopasnosti', 'подушка безопасности', 'подушка безопасности', 'подушкабезопасности', 'airbag', 'подушка безопастности', 'подушка бзп'],
        "USD": ["usd", "юсд"],
        "евро": ["EUR", "euro", "евр"],
        "RUB": ["руб", "рубли", "ryb", "rub", "русрубль", "рублях"],
        "CNY": ["cny", "юань", "юани"],
        "Кредит": [
            "kredit",
            "кредиты",
            "кредитный",
            "кредитование",
            "займ",
            "loan",
            "кредитик",
        ],
        "ИП": ["ip", "ип-шник", "ипэшник"],
        "USSD-запрос": [
            "ussd-zapros",
            "USSD-запрос",
            "ussd-запрос",
            "ussd-код",
            "USSD-service",
            "юссд",
            "ussd",
            "USSD",
        ],
    }
)


def slice_windows(arr, n):
    if not arr or n <= 0 or n > len(arr):
        return []

    windows = []
    for i in range(len(arr) - n + 1):
        windows.append(arr[i : i + n])
    return windows


def format_input(v: str) -> str:
    words = v.lower().strip().split(" ")
    return [ALIASES.get(x) or x for x in words]
